
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьПолей()
	
	Если Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыДокументов.Договор") Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОбязательностьПолей();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Согласован.Доступность = РольДоступна("СогласованиеДокументов");
	
	Если Не Объект.Подразделение.Пустая() Тогда
		ТекущийПользователь = ОбщийМодульСистема.ПолучитьТекущегоПользователя();
		РуководительПодразделения = Объект.Подразделение.Руководитель;
		Элементы.Согласован.Доступность = Элементы.Согласован.Доступность Или (ТекущийПользователь = РуководительПодразделения);
	КонецЕсли;
КонецПроцедуры
