
Процедура ПередЗаписью(Отказ)
	Если не ПустаяСтрока(Наименование) Тогда
		текП = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		Если текП = Неопределено Тогда
			НовыйП = ПользователиИнформационнойБазы.СоздатьПользователя();
			
			НовыйП.Имя = Наименование;
			НовыйП.ПолноеИмя = Наименование;
			Если ЭтоАдминистратор Тогда
				
				НовыйП.Роли.Добавить(Метаданные.Роли.Администратор);
				
			Иначе
				
				НовыйП.Роли.Добавить(Метаданные.Роли.ОбычныйПользователь);
				
				
			КонецЕсли;  
			
			НовыйП.Записать();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
